// locations.js
export const locations = {
  provinces: {
    "นราธิวาส": {
      districts: {
        "เมืองนราธิวาส": ["บางนาค", "ลำภู", "มะนังตายอ", "บางปอ", "กะลุวอ", "กะลุวอเหนือ", "โคกเคียน"],
        "ตากใบ": ["เจ๊ะเห", "ไพรวัน", "พร่อน", "ศาลาใหม่", "บางขุนทอง", "เกาะสะท้อน", "นานาค", "โฆษิต"],
        "บาเจาะ": ["บาเจาะ", "ลุโบะสาวอ", "กาเยาะมาตี", "ปะลุกาสาเมาะ", "บาเระเหนือ", "บาเระใต้"],
        "ยี่งอ": ["ยี่งอ", "ละหาร", "จอเบาะ", "ลุโบะบายะ", "ลุโบะบือซา", "ตะปอเยาะ"],
        "ระแงะ": ["ตันหยงมัส", "ตันหยงลิมอ", "บองอ", "กาลิซา", "บาโงสะโต", "เฉลิม", "มะรือโบตก"],
        "รือเสาะ": ["รือเสาะ", "สาวอ", "เรียง", "สามัคคี", "บาตง", "ลาโละ", "รือเสาะออก", "โคกสะตอ", "สุวารี"],
        "ศรีสาคร": ["ซากอ", "ตะมะยูง", "ศรีสาคร", "เชิงคีรี", "กาหลง", "ศรีบรรพต"],
        "แว้ง": ["แว้ง", "กายูคละ", "ฆอเลาะ", "โละจูด", "แม่ดง", "เอราวัณ"],
        "สุคิริน": ["มาโมง", "สุคิริน", "เกียร์", "ภูเขาทอง", "ร่มไทร"],
        "สุไหงโก-ลก": ["สุไหงโก-ลก", "ปาเสมัส", "มูโนะ", "ปูโยะ"],
        "สุไหงปาดี": ["ปะลุรู", "สุไหงปาดี", "โต๊ะเด็ง", "สากอ", "ริโก๋", "กาวะ"],
        "จะแนะ": ["จะแนะ", "ดุซงญอ", "ผดุงมาตร", "ช้างเผือก"],
        "เจาะไอร้อง": ["จวบ", "บูกิต", "มะรือโบออก"]
      }
    }
  },

  hospitals: [
    "โรงพยาบาลนราธิวาสราชนครินทร์",
    "โรงพยาบาลส่งเสริมสุขภาพตำบลลำภู",
    "โรงพยาบาลกัลยาณิวัฒนาการุณย์"
  ]
};
